# print("QWERert343".lover())
# print("QWERert343".upper())
# print("QWERert343".isdigit())

# name "Alisa"
# print(f"Hello", {name}! )

#  или

# (function) def print(
#     *values: object,
#     sep: str | None = " ",
#     end: str | None = "\n",
#     file: SupportsWrite[str] | None = None,
#     flush: Literal[False] = False
# ) -> None

#  Напишіть програму, в якій користувач вводить пароль і якщо він співпадає із наперед визначеним паролем для цього користувача, то виводиться повідомлення Password accepted.. У іншому випадку повідомлення буде Sorry, that is the wrong password..

# Користувачем вводиться два імені. 

# Використовуючи конструкцію розгалуження програма повинна вивести імена в алфавітному порядку.

# Напишіть програму, яка виводить назви введених чисел. 

# Користувач вводить ціле число. Якщо це число або 1 або 2 або 3, то виводиться повідомлення - назва числа, відповідно, One, Two, Three. В усіх інших випадках виводиться слово Unknown.

# Користувач вводить дві різних англійські літери в окремих рядках. Напишіть програму, яка виводить повідомлення про місце розташування однієї літери відносно іншої у алфавіті.

# 5. Напишіть програму, в якій користувач вводить значення температури, і, якщо це значення менше або дорівнює 0 градусів Цельсія, необхідно вивести повідомлення A cold, isn’t it?. Якщо ж температура становить більше 0 і менше 10 градусів Цельсія повідомлення буде Cool., у інших випадках Nice weather we’re having..

# Напишіть програму для знаходження коренів квадратного рівняння a*x2 + b*x + c = 0. Користувач вводить значення коефіцієнтів a, b, c. У вхідних даних наведено три пари вхідних значень коефіцієнтів, а у вихідних даних - відповідні повідомлення про кількість коренів або їх відсутність.
# Вхідні дані:
8
4
2
3.6
10
-3
2
4
2
Вихідні дані:
No roots.
0.27 and -3.05
-1.00

Середній рівень

Визначте назву геометричної фігури за введеною кількістю її сторін. Програма повинна підтримувати фігури від 3 до 6 сторін. Якщо введена кількість сторін поза межами цього діапазону, програма повинна відображати відповідне повідомлення.
Ігрове поле рулетки поділено на номери від 0 до 36, які мають чорний, червоний або зелений кольори. Номер 0 має зелений колір, для номерів від 1 до 10, непарні номери - червоні, а парні - чорні. Непарні номери від 11 до 18 - чорні, а парні номери - червоні. Непарні номери від 19 до 28 - червоні, а парні номери - чорні. Непарні номери від 29 до 36 - чорні, а парні номери - червоні. Напишіть програму, яка отримує номер (число від 0 до 36) та показує, чи є номер зеленим, червоним або чорним. Програма повинна враховувати варіант, якщо користувач вводить номер, який знаходиться за межами діапазону від 0 до 36.


Дано дві точки: A (x1, y1) і B (x2, y2). Напишіть програму, яка визначає, яка із точок знаходиться далі від початку координат.

 Вхідні дані:
 1
 2
 3
 2
 4
 4
 4
 4

 Вихідні дані:
 B
 The distance is the same 

Дано дві точки: A (x1, y1) і B (x2, y2). Напишіть програму, яка визначає, яка із точок знаходиться далі від початку координат.

 Вхідні дані:
 1
 2
 3
 2
 4
 4
 4
 4

 Вихідні дані:
 B
 The distance is the same 

Дано дві точки: A (x1, y1) і B (x2, y2). Напишіть програму, яка визначає, яка із точок знаходиться далі від початку координат.

 Вхідні дані:
 1
 2
 3
 2
 4
 4
 4
 4

 Вихідні дані:
 B
 The distance is the same 

Дано чотирицифрове число. Замінити усі парні цифри числа на символ * і вивести число.
Вхідні дані:
2358
2227
1353
Вихідні дані:
*35*
***7
1353

Напишіть програму, щоб визначити, чи задане ціле число (вводиться користувачем) парне або непарне.
Вхідні дані:
2
5
11
Вихідні дані:
True
False
False

Напишіть програму для знаходження коренів квадратного рівняння a*x2 + b*x + c = 0. Користувач вводить значення коефіцієнтів a, b, c. У вхідних даних наведено три пари вхідних значень коефіцієнтів, а у вихідних даних - відповідні повідомлення про кількість коренів або їх відсутність.
Вхідні дані:
8
4
2
3.6
10
-3
2
4
2
Вихідні дані:
No roots.
0.27 and -3.05
-1.00

Напишіть програму для знаходження коренів квадратного рівняння a*x2 + b*x + c = 0. Користувач вводить значення коефіцієнтів a, b, c. У вхідних даних наведено три пари вхідних значень коефіцієнтів, а у вихідних даних - відповідні повідомлення про кількість коренів або їх відсутність.
Вхідні дані:
8
4
2
3.6
10
-3
2
4
2
Вихідні дані:
No roots.
0.27 and -3.05
-1.00

Напишіть програму, яка по введеному числу n від 1 до 9 виводить на екран n пінгвінів з відповідним номером - число від 1 до n. Зображення одного пінгвіна має розмір 5 x 9 символів, між двома сусідніми пінгвінами також є порожній (з пропусків) стовпець. Дозволяється вивести порожній стовпець після останнього пінгвіна. Для спрощення малювання скопіюйте пінгвіна із вихідних даних. Врахуйте, що виведення на екран виконується порядково, а не «попінгвінно».
 Вхідні дані: 
 4 
 Вихідні дані: 
    _~_        _~_        _~_        _~_ 
   (o o)      (o o)      (o o)      (o o) 
  /  V  \    /  V  \    /  V  \    /  V  \ 
 /(  1  )\  /(  2  )\  /(  3  )\  /(  4  )\ 
   ^^ ^^      ^^ ^^      ^^ ^^      ^^ ^^

У рядку є кілька слів, розділених одним або декількома пропусками. Потрібно прибрати з тексту зайві пропуски: два і більше пропусків поспіль, а також всі пропуски на початку і в кінці рядка. На вхід програмі подається рядок, що складається не більше ніж з 255 символів. Надрукувати новий рядок.
Вхідні дані:
   Beyond the green     swelling hills of the     Mittel Land rose mighty slopes of forest    up    to the lofty steeps of the Carpathians    themselves
Вихідні дані:
Beyond the green swelling hills of the Mittel Land rose mighty slopes of forest up to the lofty steeps of the Carpathians themselves

Дано рядок, що складається з n цифр (тобто одноцифрових чисел), між якими стоїть n-1 знаків операцій, кожна з яких може бути або +, або -. Обчисліть значення цього виразу. Програма має надрукувати результат обчислення цього виразу.
Вхідні дані:
5-3+1
6+3-2
Вихідні дані:
3
7

Напишіть програму, на вхід якої даються чотири числа a, b, c і d, кожне у своєму рядку. Програма повинна вивести фрагмент таблиці множення для всіх чисел відрізка [a; b] на всі числа відрізка [c; d]. Числа a, b, c і d є натуральними і не перевищують 10, a ≤ b, c ≤ d. Дотримуйтесь формату виведення як у вихідних даних. Для поділу елементів всередині рядка використовуйте \t - символ табуляції. Зауважте, що лівим стовпчиком і верхнім рядком виводяться самі числа із заданих відрізків.
Вхідні дані:
1
4
2
5
Вихідні дані:
	2	3	4	5
1	2	3	4	5
2	4	6	8	10
3	6	9	12	15
4	8	12	16	20


Напишіть програму для друку літери A за допомогою введеного користувачем символа.
 Вхідні дані: 
 * 
 Вихідні дані: 
   *** 
  *   * 
  *   * 
  ***** 
  *   * 
  *   * 
  *   * 

Напишіть програму, яка визначає, чи є у введеному рядку десяткові цифри, і виводить найбільше число, яке можна скласти з цих цифр. Провідних нулів у числі бути не повинно (за винятком числа 0, запис якого містить рівно одну цифру). Гарантовано, що у рядку є принаймні одна цифра. Вхідний рядок містить довільні символи. Програма повинна вивести найбільше число, яке можна скласти з присутніх в рядку десяткових цифр.
Вхідні дані:
Release Date: July 27, 2008
Last Updated: February 22, 2018
Вихідні дані:
872200
822210

