# Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.
# n1 = int (input (Enter number_1))
# n2 = int (input (tnter number _2))
# print (n1 + n2)

# Гіпотенуза: За двома катетами прямокутного трикутника знайти довжину його гіпотенузи.
# a = int (input ("Enter first numer: "))
# b = int (input ("Enter sekond numer: "))
print ("hypotenuse:",)

# Двічі: Написати програму, яка зчитує ціле число та виводить його двічі.

# Привіт, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить привітання.

# Прощавай, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить прощання.

# Вік через рік: Напишіть програму, яка запитує ім'я користувача та його вік. Потім виведіть повідомлення, яке повідомляє, скільки йому буде років через рік.

# Площа прямокутника: Напишіть програму, яка запитує довжину та ширину прямокутника, а потім обчислює та виводить його площу.

# Конвертер валют: Запропонуйте користувачеві ввести суму в одній валюті (наприклад, доларах), а потім виведіть цю суму в іншій валюті (наприклад, євро), використовуючи заздалегідь визначений коефіцієнт обміну.

# Вартість покупки: Запитайте користувача назву товару, його ціну та кількість. Обчисліть загальну вартість покупки та виведіть її на екран.

# Температура: Напишіть програму, яка перетворює температуру з градусів Цельсія на Фаренгейт. Запитайте користувача температуру в градусах Цельсія.

Домашнє завдання:

Задача 1. Середнє трьох чисел
Користувач вводить три числа. Обчисли середнє арифметичне.

Задача 2. Остача від ділення
Користувач вводить два числа. Знайди остачу від ділення першого на друге.

Задача 3. Подвоєне число
Користувач вводить число. Виведи подвоєне значення цього числа.

Задача 4. Конвертація хвилин у секунди
Користувач вводить кількість хвилин. Обчисли, скільки це буде секунд.

Задача 5. Кількість яблук на кожного
Є n яблук і k учнів. Скільки яблук отримає кожен учень, якщо ділити порівну, і скільки залишиться?

Задача 6. Остання цифра числа
Користувач вводить число. Виведи його останню цифру.

Задача 7*. Обмін змінних
Користувач вводить два числа. Після цього потрібно “поміняти” їх місцями і вивести результат.