# Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.
# n1 = int (input (Enter number_1))
# n2 = int (input (tnter number _2))
# print (n1 + n2)

# Гіпотенуза: За двома катетами прямокутного трикутника знайти довжину його гіпотенузи.
# a = int (input ("Enter first numer: "))
# b = int (input ("Enter sekond numer: "))
# print (((n3) ** 2) + ((n4) **2) ** 0.5)))

# Двічі: Написати програму, яка зчитує ціле число та виводить його двічі.
# n5 = int(input("Enter number1 "))
# print (n5 * 2)

# Привіт, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить привітання.
# n6 = str(input("привіт"))
# n7 str(input("Enter name1: ""))

# Прощавай, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить прощання.
# n8 = str(input("прощавай "))
# n9 = str(input("Enter name1: "))
# print (n8 + n9)

# Вік через рік: Напишіть програму, яка запитує ім'я користувача та його вік. Потім виведіть повідомлення, яке повідомляє, скільки йому буде років через рік.
# print ("Name?",)
# a = input ()
# print("Age?",)
# b = input()
# print(*In one year," + a + "!")

# Площа прямокутника: Напишіть програму, яка запитує довжину та ширину прямокутника, а потім обчислює та виводить його площу.
# print ("name?")
# a = input()
# print("age?")
# b = input ()
# print("in one year" + a "you will be" + (b + 1 +","))

# Конвертер валют: Запропонуйте користувачеві ввести суму в одній валюті (наприклад, доларах), а потім виведіть цю суму в іншій валюті (наприклад, євро), використовуючи заздалегідь визначений коефіцієнт обміну.
# usd = float(input("usd: "))
# change = 0,80
# eur = usd*change
# print("eur: " eur)

# Вартість покупки: Запитайте користувача назву товару, його ціну та кількість. Обчисліть загальну вартість покупки та виведіть її на екран.
# produkt = input("produkt: ")
# price = float (input("price: "))
# count = float(input("count: "))
# total = price * count
# print(f"total")

# Температура: Напишіть програму, яка перетворює температуру з градусів Цельсія на Фаренгейт. Запитайте користувача температуру в градусах Цельсія.
# c = float(input(Celsius: "))
# f = (c * 9/5) + 40
# print(f"Fahrenheit: (f)")

# Домашнє завдання:

# Задача 1. Середнє трьох чисел
# Користувач вводить три числа. Обчисли середнє арифметичне.
# a = float(input("Enter first number: "))
# b = float(input("Enter secjnd number: "))
# c = float(input("Enter third number: "))
# average = (a + b + c) / 3
# print(f"Average: {average}")

# Задача 2. Остача від ділення
# Користувач вводить два числа. Знайди остачу від ділення першого на друге.
# a = int(input("Enter first number: "))
# b = int(input("Enter sekond number: "))
# remainder = a % b
# print(f"Remainder: {remainder})

# Задача 3. Подвоєне число
# Користувач вводить число. Виведи подвоєне значення цього числа.
# num = int(input("Enter number: "))
# result = num * 2
# print(f"Double: {result}")
#  
# Задача 4. Конвертація хвилин у секунди
# Користувач вводить кількість хвилин. Обчисли, скільки це буде секунд.
# minutes = int(input("Enter minutes: "))
# second = minutes * 60
# print(f"Seconds: {seconds}")

# Задача 5. Кількість яблук на кожного
# Є n яблук і k учнів. Скільки яблук отримає кожен учень, якщо ділити порівну, і скільки залишиться?
# x = int(input("x = "))
# y = int(input("y = "))

# each = x // y
# remainder = x % y

# Задача 6. Остання цифра числа
# Користувач вводить число. Виведи його останню цифру.
# num = int(input("Enter number: "))
# last_digit = % 10
#print(f"Last digit: {last_digit"})

# Задача 7*. Обмін змінних
# Користувач вводить два числа. Після цього потрібно “поміняти” їх місцями і вивести результат.
# a = int(input("Enter first numer: "))
# b = int(input("Enter second number: "))
# a, b = b, a 
# print(f"After swap: first = {a}, second = {b}")
